/**
* @猴子选大王.cpp
* @brief 实现
* @date 2025-11-23
*
*@detials
* ##题目描述
*一群猴子要选新猴王。新猴王的选择方法是：
*让N只候选猴子围成一圈，从某位置起顺序编号为1~N号。
*从第1号开始报数，每轮从1报到3，凡报到3的猴子即退出圈子，
*接着又从紧邻的下一只猴子开始同样的报数。如此不断循环，
*最后剩下的一只猴子就选为猴王。请问是原来第几号猴子当选猴王？
* 
* ##解题思路
* 1.设置数组a和b，a用于记录猴子的编号，b用于排除数到3的猴子
* 2.数到3==是3的倍数
* 3.对数组b进行循环赋值，排除掉的令其等于0，且不参与接下来的赋值
* 4.当数组b只有一个元素不等于0，对应的数组a的值就是答案
*
*/
#include<stdio.h>
#define MAX 1000
int main()
{
	int n = 0;
	scanf_s("%d", &n);
	int a[MAX];
	int b[MAX];
	int i = 0;             //保证数组a与数组b可以一一对应
	int s = 1;             //对数组b赋值
	int num = n;           //记录剩余猴子的个数
	for (i = 0; i < n; i++) {
		a[i] = s++;
		b[i] = a[i];
		if (b[i] % 3 == 0) {
			b[i] = 0;
			num--;
		}                  //第一轮筛选
		if (num == 1) {
			break;
		}
	}
	while (num > 1) {
		for (i = 0; i < n; i++) {
			if (b[i] != 0) {
				b[i] = s++;
				if (b[i] % 3 == 0) {
					b[i] = 0;
					num--;
				}          //循环筛选
				if (num == 1) {
					break ;
				}
			}
		}
		i = 0;
	}
	for (i = 0; i < n; i++) {
		if (b[i] != 0) {
			printf("%d", a[i]);
		}
	}
	return 0;
}
